In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 컬럼 
#### 컬럼 추가

In [ ]:
df['Age_kor'] = df['Age'] + 1
df.head(2)

- Age, Age_kor / 상위 5개만

In [7]:
df['new_col_1'] = df['Age'] + df['Fare']
df[['Age', 'Fare', 'new_col_1']].head(3)

    Age     Fare  new_col_1
0  22.0   7.2500    29.2500
1  38.0  71.2833   109.2833
2  26.0   7.9250    33.9250

In [11]:
df['new_col_1'] != df['Age'] + df['Fare']

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Length: 891, dtype: bool

In [13]:
df[df['new_col_1'] != df['Age'] + df['Fare']][['Age', 'Fare', 'new_col_1']]

     Age     Fare  new_col_1
5    NaN   8.4583        NaN
17   NaN  13.0000        NaN
19   NaN   7.2250        NaN
26   NaN   7.2250        NaN
28   NaN   7.8792        NaN
..   ...      ...        ...
859  NaN   7.2292        NaN
863  NaN  69.5500        NaN
868  NaN   9.5000        NaN
878  NaN   7.8958        NaN
888  NaN  23.4500        NaN

[177 rows x 3 columns]

In [ ]:
df[df['new_col_1'] != df['Age'] + df['Fare']][['Age', 'Fare', 'new_col_1']]

In [ ]:
df['new_col_2'] = np.nan
df.head(3)

#### 컬럼 변경

In [16]:
df['new_col_2'] = 2
df[['new_col_2']].head(3)

   new_col_2
0          2
1          2
2          2

In [20]:
df['new_col_2'] = df['Age'] + 10
df[['Age', 'new_col_2']].head(3)

    Age  new_col_2
0  22.0       32.0
1  38.0       48.0
2  26.0       36.0

#### 컬럼 삭제
- drop : 원본에 바로 적용되지 않음 -> 1. 다시 저장 / 2.inplace=True
- del : 원본에 바로 적용

In [23]:
# drop
df.drop('Age_kor', axis=1)
df[['Age_kor']].head()

   Age_kor
0     23.0
1     39.0
2     27.0
3     36.0
4     36.0

In [95]:
df.head()

,PassengerId,Survived,Pclass,Real-Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [27]:
# drop
# df.drop('Age_kor', axis=1, inplace=True)
df = df.drop('Age_kor', axis=1)
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'new_col_1',
       'new_col_2'],
      dtype='object')

In [28]:
'Age_kor' in df.columns

False

In [29]:
# del : 원본에서 바로 삭제 된 -> dataFrame에 다시 저장하거나 inplace option 필요 없음
del df['new_col_2']
'new_col_2' in df.columns

False

In [ ]:
df.drop(['Cabin', 'Embarked'], axis=1).columns

In [32]:
del [df['Cabin'], df['Embarked']]
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'new_col_1'],
      dtype='object')

### Data(row)

#### data(row) 추가
- list
- dictionary

In [72]:
df = pd.read_csv('./train.csv')
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [38]:
df.shape

(891, 12)

- list 추가

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [40]:
list_891 = [1, 1, 1, 'a', 'male', 70.0, 1, 0, 'b', 1, 'c', 'd']
df.loc[891] = list_891
df.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q
891,1,1,1,a,male,70.0,1,0,b,1.00,c,d

In [41]:
dic_892 = {'PassengerId':1, 'Survived':1, 'Pclass':2, 'Name':'g', 
           'Sex':'female', 'Age':68.0, 'SibSp':1,
           'Parch':0, 'Ticket':'h', 'Fare':1, 'Cabin':'j', 'Embarked':'k'}
df.loc[892] = dic_892
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q
891,1,1,1,a,male,70.0,1,0,b,1.00,c,d
892,1,1,2,g,female,68.0,1,0,h,1.00,j,k

#### data(row)변경

In [47]:
df.loc[1] = list_891
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
1,1,1,1,a,male,70.0,1,0,b,1.000,c,d
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

In [49]:
df.loc[3] = dic_892
df.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
1,1,1,1,a,male,70.0,1,0,b,1.000,c,d
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,1,1,2,g,female,68.0,1,0,h,1.000,j,k

#### data(row)삭제

In [51]:
# axis = 0 이 default
# inplace=True
df.drop(892, axis=0, inplace=True)
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q
891,1,1,1,a,male,70.0,1,0,b,1.00,c,d

### 특정 data 변경

In [52]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
1,1,1,1,a,male,70.0,1,0,b,1.000,c,d
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

In [54]:
df.loc[2, 'Name'] =  'No name'
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
1,1,1,1,a,male,70.0,1,0,b,1.000,c,d
2,3,1,3,No name,female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

In [78]:
df.loc[2, 'Name']

'Heikkinen, Miss. Laina'

In [82]:
df.loc[df['Age'] > 60, 'Name'] = 'aaa'

- 나이가 70 넘으신 분의 나이를 0으로 변경

In [74]:
df.loc[df['Age'] > 70, 'Age'] = 0

### 컬럼 타입/명 변경

#### 컬럼 Type 변경
- astype
    - inplace option이 없음
- 변경할 컬럼의 data중 nan이 있으면 에러 발생

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
df = df.astype({'SibSp':'float'})
df.info()

In [ ]:
df = df.astype({'Age':'int'})
df.info()

In [90]:
df['SibSp'] = df['SibSp'].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int32
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int32(1), int64(4), object(5)
memory usage: 80.2+ KB

#### 컬럼명 변경

- 전체 바꾸기

In [91]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
df.columns = ['PassengerId', 'Survived', 'Pclass', 'real-Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

- 특정 컬럼명 바꾸기

In [94]:
df.rename(columns = {'Name':'Real-Name'}, inplace=True)
df.head()

,PassengerId,Survived,Pclass,Real-Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S